app/controllers/articles_controller.rb

    def update
       # @article = Article.find(params[:id])
        @article.update(title: params[:article] [:title], content: params[:article] [:content])
---
UPDATE "articles" SET "updated_at" = ? WHERE "articles"."id" = ?  [["updated_at", "2021-12-27 17:50:34.044991"], ["id", 6]]

    def create
      @article =  Article.create(title: params[:article] [:title], content: params[:article] [:content])
---
INSERT INTO "articles" ("title", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Articulo Numero 5"], ["status", nil], ["created_at", "2021-12-27 17:50:34.022123"], ["updated_at", "2021-12-27 17:50:34.022123"]]